Documents/ЛБ_РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РасходныйКассовыйОрдер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРКО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомераРКО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийРКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдано</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КорпоративныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДУЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзLX</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийРКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаПереоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПроцентовПоЗаявке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратРазницыРеализацииНевостребованногоЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЦентральнуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВКассуЛомбарда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДляСдачиНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДляЗачисленияНаКорпоративнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДепонированнойЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводныйРКО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_РасходныйКассовыйОрдер/Ext/ObjectModule.bsl
Перем КассоваяСмена Экспорт; 

Функция ПолучитьДатуНачалаРасчетаПроцентов(ЗалоговыйБилет)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период КАК Период,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если НЕ Выборка.ДатаНачалаРасчета = Дата(1,1,1) Тогда
			Возврат Выборка.ДатаНачалаРасчета;
		КонецЕсли;	
	КонецЦикла;
	Возврат ЗалоговыйБилет.Дата;
КонецФункции

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		СписокНеЗаполненныхРеквизитов = "";
		КолРеквизитов = 0;
		ПроверятьОстаток = Истина;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Организация"; 
			КолРеквизитов = КолРеквизитов + 1; 
			ПроверятьОстаток = Ложь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ломбард) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Ломбард"; 
			КолРеквизитов = КолРеквизитов + 1;
			ПроверятьОстаток = Ложь;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидОперации) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Вид операции"; 
			КолРеквизитов = КолРеквизитов + 1;
		КонецЕсли;
        Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПредставлениеНомераРКО) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Номер РКО";
			КолРеквизитов = КолРеквизитов + 1;
		КонецЕсли;                        
		Если НЕ ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.СводныйРКО Тогда
	        Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Сумма) Тогда 
				СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Сумма";
				КолРеквизитов = КолРеквизитов + 1;
			КонецЕсли;
			//Савранин ++
			Если НЕ ЗагруженИзLX Тогда
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда 
					СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Получатель";
					КолРеквизитов = КолРеквизитов + 1;
				КонецЕсли;  
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Выдано) Тогда 
					СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Выдано";
					КолРеквизитов = КолРеквизитов + 1;
				КонецЕсли; 
			КонецЕсли; 
			//Савранин ++
			Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаДляЗачисленияНаКорпоративнуюКарту Тогда
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект.БанковскаяКарта) Тогда 
					СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Банковская карта";
					КолРеквизитов = КолРеквизитов + 1;
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;	
		
		Если НЕ КолРеквизитов = 0 Тогда   
			ТекстСообщения = ?(КолРеквизитов = 1, "Не заполнен реквизит документа ", "Не заполнены реквизиты документа ");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + СписокНеЗаполненныхРеквизитов);
			Отказ = Истина;
		КонецЕсли;	
		
		Если ПроверятьОстаток Тогда
			СуммаОстаток = ЛБ_ОбщийМодуль.ПроверитьНаличиеСуммыВКассеЛомбарда(?(ЗначениеЗаполнено(ЭтотОбъект.Ссылка), Дата, ТекущаяДатаСеанса()), Организация, Ломбард); 
			Если СуммаОстаток < ЭтотОбъект.Сумма Тогда
				ОбщегоНазначения.СообщитьПользователю("Остаток в кассе ломбарда " + СокрЛП(Формат(СуммаОстаток, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=0,00")) + " руб., выдача ден. средств запрещена!");
				//Отказ = Истина;  //Закомментировала временно. Убрать потом!!!
			КонецЕсли;	
		КонецЕсли;	    
		//Закомментировала временно. Убрать потом!!!
		//Если НЕ Отказ Тогда
		//	Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		//		Если НачалоДня(Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда 
		//			Если НЕ ЭтотОбъект.Проведен ИЛИ ЛБ_ОбщийМодуль.КассовыеСменаСовпадаетСТекущей(ЭтотОбъект) Тогда
		//			    Дата = ТекущаяДатаСеанса(); 
		//			КонецЕсли;	
		//		ИначеЕсли НЕ ЭтотОбъект.Проведен Тогда
		//			ОбщегоНазначения.СообщитьПользователю("Неоперативное проведение документа запрещено!");
		//		    Отказ = Истина;
		//		КонецЕсли;	                   
		//	КонецЕсли;	
		//КонецЕсли;                                  
		//Закомментировала временно. Убрать потом!!!

		//Если НЕ Отказ Тогда
		//     Результат = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард); 
		//	 Если НЕ Результат = неопределено Тогда 
		//	     КассоваяСмена = Результат.КассоваяСмена;
		//	Иначе           
		//		ОбщегоНазначения.СообщитьПользователю("На дату документа не открыта кассовая смена!");
		//		Отказ = Истина;
		//	КонецЕсли;	  
		//КонецЕсли;
		//Если НЕ Отказ Тогда
		//	Если ЛБ_ОбщийМодуль.ПроверитьЕстьОтменаКО(Ссылка) Тогда 
		//		ОбщегоНазначения.СообщитьПользователю("Эта операция отменена!");
		//		Отказ = Истина;
		//	КонецЕсли;
		//КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // ПередЗаписью()


// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Результат = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард); 
	Если НЕ Результат = неопределено Тогда 
	     КассоваяСмена = Результат.КассоваяСмена;  
	Иначе	 
        Отказ = Истина;  
		ОбщегоНазначения.СообщитьПользователю("На дату документа не открыта кассовая смена!");
		Возврат;
	КонецЕсли;	   
	
	Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
    Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
	Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;

	Если НЕ ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.СводныйРКО Тогда
		Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
		Движение.Сумма = ЭтотОбъект.Сумма;

		Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
		Движение.КассоваяСмена = КассоваяСмена;
		Движение.КассоваяОперация = ЭтотОбъект.Ссылка;
		Движение.Сумма = ЭтотОбъект.Сумма;      
		Движение.ВидОперации = ЭтотОбъект.ВидОперации;   
		Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Расход;
		Движение.Номер = ЭтотОбъект.ПредставлениеНомераРКО;
		Движение.Дт = ЭтотОбъект.Дт;
		Движение.Кт = ЭтотОбъект.Кт;  
		Движение.ФизическоеЛицо = ЭтотОбъект.Контрагент;
		Движение.Контрагент = ЭтотОбъект.Контрагент;
		Движение.ФИО = ЭтотОбъект.Выдано; 
		Движение.ДУЛ = ЭтотОбъект.ДУЛ;
		Движение.Основание = ЭтотОбъект.Основание;  
		Движение.Приложение = ЭтотОбъект.Приложение;
		Движение.ДополнительнаяИнформация = ЭтотОбъект.ДополнительнаяИнформация; 
		Движение.БанковскаяКарта = ЭтотОбъект.БанковскаяКарта;
		
 //   	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентов ИЛИ 
 //   		 ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке Тогда  
 //   	    ДатаНачалаРасчета = ПолучитьДатуНачалаРасчетаПроцентов(ЭтотОбъект.ЗалоговыйБилет); 
 //
 //   		Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
 //   		Движение.Период = Дата;
 //   		Движение.Организация = Организация;   
 //   		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
 //   		Движение.Клиент = Контрагент;    
 //   		Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
 //   		Движение.ДатаНачалаРасчета = ПолучитьДатуНачалаРасчетаПроцентов(ЭтотОбъект.ЗалоговыйБилет);
 //   		Движение.ЗалоговыйБилет = ЭтотОбъект.ЗалоговыйБилет;
 //   		Движение.Сумма = -Сумма;
 //   	КонецЕсли;	 
	КонецЕсли;	
КонецПроцедуры	        

КассоваяСмена = Документы.ЛБ_ОперацииКассовойСмены.ПустаяСсылка();
